clc

fin = fopen('file3.txt', 'r');
a = fscanf(fin, '%f', 3);
b = fscanf(fin, '%f', 3);

%lenA = (a(1,1)^2 + a(2,1)^2)^(0.5);
%lenB = (b(1,1)^2 + b(2,1)^2)^(0.5);

%t = [a';b'];

delta = a(1,1) / b(1,1);
if(delta == (a(2,1) / b(2,1)))
    if (delta == (a(3,1) / b(3,1)))
        fprintf("Вектора совпадают\n");
    else
        fprint("Вектора параллельны\n");
    end
else
    %phi =  det(t)/((a(1,1) * a(2,1)) + (b(1,1) * b(2,1)));
    %phi - угол между векторами
    %cosp = cos(phi);
    %fprintf("Скалярное произведение = %6.3f\n", (lenA * lenB * cosp));
    
    %Г-2 § 4 - скалярное произв. - сумма попарного произв. векторов,
    %поэтому можно без phi
    
    c = a.*b;
    
    fprintf("Скалярное произведение = %6.2f\n", sum(c));
    
    if (sum(c) > 0)% Векторное пр. возможно только при правой тройке =>
                   % => только при phi < 90гр. => при против часовой < по
        
        lenA = (a(1,1)^2 + a(2,1)^2 + a(3,1)^2)^(0.5);
        lenB = (b(1,1)^2 + b(2,1)^2 + b(3,1)^2)^(0.5);
        i = [a(2,1) a(3,1); b(2,1) b(3,1)];
        j = [a(1,1) a(3,1); b(1,1) b(3,1)];
        k = [a(1,1) a(2,1); b(1,1) b(2,1)];
        
        c = [det(i); -det(j); det(k)];
        
        disp('Векторное произведение = ');
        disp(c');
    elseif(sum(c) == 0) %90гр
            fprintf("Вектора перпендикулярны\n");
    else
        frpintf("Векторное произведение невозможно найти\n");
    end
    
end